using System;
using System.Collections.Generic;
using System.ComponentModel.Composition;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Dek.Bel.Services
{
    [Export]
    public class StupidEncodingFixer
    {
        public static Dictionary<string, string> GreekEncodingMapper = new Dictionary<string, string>
        {
            // Ά·ΈΉΊΌΎΏΐΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΨΩΪΫάέήίΰ
            // αβγδεζηθικλμνξοπρςστυφχψωϊϋόύώϏϐϑϒϓϔϕϖϗϘϙϛϜϝϞϟϠϡϰϱϲϳϴϵ϶ϷϸϹϺϻϼϽϾϿ

            //{"", "Ά"},
            {"É", "·"},
            //{"", "Έ"},
            //{"", "Ή"},
            //{"", "Ί"},
            //{"", "Ό"},
            //{"", "Ύ"},
            //{"", "Ώ"},
            //{"", "ΐ"},
            {"A", "Α"},
            {"B", "Β"},
            {"G", "Γ"},
            {"D", "Δ"},
            {"E", "Ε"},
            //{"", "Ζ"},
            //{"", "Η"},
            //{"", "Θ"},
            {"I", "Ι"},
            {"K", "Κ"},
            {"L", "Λ"},
            {"M", "Μ"},
            {"N", "Ν"},
            {"J", "Ξ"},
            {"O", "Ο"},
            {"P", "Π"},
            {"R", "Ρ"},
            {"S", "Σ"},
            {"T", "Τ"},
            {"U", "Υ"},
            {"F", "Φ"},
            {"X", "Χ"},
            //{"", "Ψ"},
            //{"", "Ω"},
            //{"", "Ϊ"},
            //{"", "Ϋ"},
            {"ã", "ά"},
            {"é", "ἀ"},
            {"¢", "έ"}, // ?
            {"Æ", "ή"},
            {"¤", "ί"},
            //{"", "ΰ"},
            {"a", "α"},
            {"b", "β"},
            {"g", "γ"},
            {"d", "δ"},
            {"e", "ε"},
            {"z", "ζ"},
            {"h", "η"},
            {"y", "θ"},
            {"i", "ι"},
            {"k", "κ"},
            {"l", "λ"},
            {"m", "μ"},
            {"n", "ν"},
            {"j", "ξ"},
            {"o", "ο"},
            {"p", "π"},
            {"r", "ρ"},
            {"w", "ς"},
            {"s", "σ"},
            {"t", "τ"},
            {"u", "υ"},
            {"Ï", "ϋ" },
            //{"", "ΰ" },
            {"f", "φ"},
            {"x", "χ"},
            //{"", "ψ"},
            {"v", "ω"},
            //{"", "ϊ"},
            {"‹",  "ὶ" },
            //{"", "ϋ"},
            //{"", "ό"},
            //{"", "ύ"},
            //{"", "ώ"},
            //{"", "Ϗ"},
            //{"", "ϐ"},
            //{"", "ϑ"},
            //{"", "ϒ"},
            //{"", "ϓ"},
            //{"", "ϔ"},
            //{"", "ϕ"},
            {"«", "ϖ"},
            //{"", "ϗ"},
            //{"", "Ϙ"},
            //{"", "ϙ"},
            //{"", "ϛ"},
            //{"", "Ϝ"},
            //{"", "ϝ"},
            //{"", "Ϟ"},
            //{"", "ϟ"},
            //{"", "Ϡ"},
            //{"", "ϡ"},
            //{"", "ϰ"},
            //{"", "ϱ"},
            //{"", "ϲ"},
            //{"", "ϳ"},
            //{"", "ϴ"},
            //{"", "ϵ"},
            //{"", "϶"},
            //{"", "Ϸ"},
            //{"", "ϸ"},
            //{"", "Ϲ"},
            //{"", "Ϻ"},
            //{"", "ϻ"},
            //{"", "ϼ"},
            //{"", "Ͻ"},
            //{"", "Ͼ"},
            //{"", "Ͽ"},
            {"¶", "ἔ"},
            //{"", ""},

        };

        public string FixGreekText(string input)
        {
            StringBuilder sb = new StringBuilder();
            for (int i = 0; i < input.Length; i++)
            {
                if (GreekEncodingMapper.ContainsKey(input[i].ToString()))
                    sb.Append(GreekEncodingMapper[input[i].ToString()]);
                else
                    sb.Append(input[i].ToString());
            }

            return sb.ToString();
        }

    }
}
